spec/fixtures/subscription_succeeded.json

{
  "id": "sub_GFHav5WiLNtneY",
  "object": "subscription",
  "application_fee_percent": null,
  "billing_cycle_anchor": 1574709281,
  "billing_thresholds": null,
  "cancel_at": null,
  "cancel_at_period_end": false,
  "canceled_at": 1574710033,
  "collection_method": "charge_automatically",
  "created": 1574709281,
  "current_period_end": 1577301281,
  "current_period_start": 1574709281,
  "customer": "cus_GFHSvOiupVX3dX",
  "days_until_due": null,
  "default_payment_method": null,
  "default_source": null,
  "default_tax_rates": [],
  "discount": null,
  "ended_at": 1574710033,
  "items": {
    "object": "list",
    "data": [
      {
        "id": "si_GFHawkPbEIGVrQ",
        "object": "subscription_item",
        "billing_thresholds": null,
        "created": 1574709281,
        "metadata": {},
        "price": {
          "id": "plan_GFHUjj4HsCJa51",
          "object": "price",
          "active": false,
          "billing_scheme": "per_unit",
          "created": 1574708937,
          "currency": "usd",
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": "8 classes pack",
          "product": "prod_GFHShRiGlvuRN8",
          "recurring": {
            "aggregate_usage": null,
            "interval": "month",
            "interval_count": 1,
            "usage_type": "licensed"
          },
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "recurring",
          "unit_amount": 1000,
          "unit_amount_decimal": "1000"
        },
        "quantity": 1,
        "subscription": "sub_GFHav5WiLNtneY",
        "tax_rates": []
      }
    ],
    "has_more": false,
    "url": "/v1/subscription_items?subscription=sub_GFHav5WiLNtneY"
  },
  "latest_invoice": "in_1Fin1BEbKIwsJiGZiMSDSLzw",
  "livemode": false,
  "metadata": {},
  "next_pending_invoice_item_invoice": null,
  "pause_collection": null,
  "pending_invoice_item_interval": null,
  "pending_setup_intent": null,
  "pending_update": null,
  "schedule": null,
  "start_date": 1574709281,
  "status": "active",
  "transfer_data": null,
  "trial_end": null,
  "trial_start": null
}
